AUTO_config_TK_pesok/src/DataProcessors/ЗакрытиеЗаказовПоставщику/ЗакрытиеЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗакрытиеЗаказовПоставщику</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <comment>Заказы поставщикам</comment>
  <resources>
    <name>Заказано</name>
    <comment>Количество номенклатуры по заказу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура заказа</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Documents/КорректировкаРегистров/КорректировкаРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРегистров</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказовПоставщику</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровКомпании</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателямиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиОрганизации</registerRecords>
  <registerRecords>InformationRegister.ОграничениеАссортимента</registerRecords>
  <registerRecords>InformationRegister.ЦеныКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваровКомпании</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>InformationRegister.ПараметрыСистемыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКомпании</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистров</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/DataProcessors/ЗакрытиеЗаказовПоставщику/ManagerModule.bsl
Функция СформироватьКорректировкуЗаказа(НаДату,ДнейОтсрочки,Ошибки="")	Экспорт 
	ВсеОК = Истина;
	СрокПоставки = НаДату-86400*ДнейОтсрочки;
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 	"ВЫБРАТЬ
	//|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	//|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	//|	ЗаказыПоставщикамОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	//|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	//|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	//|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	//|			ИНАЧЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки
	//|		КОНЕЦ <= &СрокПоставки
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗаказПоставщику
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	|	ЗаказыПоставщикамОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	|		ИНАЧЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки
	|	КОНЕЦ КАК СрокПоставки
	|ПОМЕСТИТЬ СрокиПоставки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрокиПоставки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СрокиПоставки.Контрагент КАК Контрагент,
	|	СрокиПоставки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	СрокиПоставки.Номенклатура КАК Номенклатура,
	|	СрокиПоставки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	СрокиПоставки.СрокПоставки КАК СрокПоставки
	|ИЗ
	|	СрокиПоставки КАК СрокиПоставки
	|ГДЕ
	|	СрокиПоставки.СрокПоставки <= &СрокПоставки";
	
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("СрокПоставки", СрокПоставки);
	//Запрос.УстановитьПараметр("Баффет", Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008"));	//	ТС Buffet
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	Выборка = Результат.Выбрать();
	
	нпп = 0;
	НуженДок = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЗаказПоставщику") Цикл 
		
		Если НуженДок Тогда
			дОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
			дОбъект.Дата = ТекущаяДата();	
			дОбъект.Ответственный = Пользователи.ТекущийПользователь();
			дОбъект.Комментарий = "Корректировка заказа поставщику"+Символы.ПС+"Сформирован автоматически "+дОбъект.Дата;
			СтрокаТЧ = дОбъект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя = "ЗаказыПоставщикам";
			
			Попытка
				дОбъект.Записать();
				НуженДок = Ложь;
				НаборЗаписей=РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение=дОбъект.Ссылка;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			нпп = нпп + 1;
			Движение=НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,Выборка);
			Движение.Регистратор = дОбъект.Ссылка;
			Движение.Период = дОбъект.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Заказано = -Выборка.ЗаказаноОстаток;
			Движение.ХозОперация = Справочники.ХозОперации.КорректировкаУчетныхДанных;
		КонецЦикла;
		
		Если нпп > 7777 Тогда
			нпп = 0;
			НуженДок = Истина;
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
			КонецПопытки;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если нпп > 0 Тогда
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
			ВсеОК = Ложь;
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат  ВсеОК;	
КонецФункции
